#+ - складывает
# - (вычитает)
# / ( делит )
# * (умножение)
# %  (остаток от деления)
#print(3%2)
# // (целочисленное деление)
#print(5//2)
# () ( обьединение)
#print((2+1) *2)
#** (воззведение в степень)
#print(27**2)

#and - логическая и
#print( 1 and 0)
#or - логическая или
#print( True or 0 )
#not - не
#print(not(True))
#!= - сравнение ( отрицание )

# #+ (складывает)
# #- (вычитает)
# #/ (делит)
# #* (умножение)
#
# #%  (остаток от деления)
# print(3%2)
# #// (целочисленное деление)
# print(5//2)
# #() (объединение)
# print((1+2) * 2)
# #** (возведение в степень)
# print(10**2)

#and - логическое и
# print(0 and True)
# #or - логическое или
# print(False or False)
#not - не
# print(not(True))
#числа и объекты
#== - сравнение (эквивалентность)
# print(True == False)
# #!= - сравнение (отрицание)
# print(5 != 5)
# #числа
# #>= <= < >
# print(10 >= 10)
#is_whether = input( " Идет ли дождь ? : ")
#if is_whether == "yes":
    #print(" Да идет ")
#elif is_whether == "no": #срабатывает если не работал if
    #print("Нет не идет")
#else: # действие срабатывет если не сработали предыдущие
    #print( " мб нет мб да ")
#a = input(" введите слово: ")
#match a:
 #   case "no":
  #      print("почему нет")
   # case "yes":
    #    print("почему да")
    #case _:
     #    print("любые символы")


# задачки
# 3: пользователь вводит число.
# если число четноеб выведите "  четное "
# иначе выведите " нечетное "

#a = int(input(" выведите число:"))
#if a%2 == 0:
#    print("четное")
#else:
 #   print("нечетное")

#9

#a = int(input("введите слово : "))
#if a>0 and a%2 == 0:
#    print("положительное и четное")
#elif a>0 and a%2 !=0:
  #  print("положительно и нечетное")
#elif a>=0 and a%10 == 0:
#    print("положительное и оканчивается на 0")
#elif a<0:
 #   print("отрицательное")

#7

#a = int(input("введите число:"))
#if a%3 and a%5 ==0:
#    print(" fizzbuzz")
#elif a%3 ==0:
#    print(" fizz")
#elif a%5 ==0:
#    print("buzz")
#else:
 #   print(a)







